package com.czm.operator;

public class Demo06 {
    public static void main(String[] args) {
        /*
        A = 1100 1011
        B = 0010 1100
        ------------------

        A&B = 0000 1000           //有0即为零 两个1才1 1为真 0为假
        A|B = 1110 1111           //有1则为1 两0才0
        A^B = 1110 0111           //相同取0 不同取1
        ~b = 1101 0011            //取反

        2*8 = 16    2*2*2*2
        效率极高！！！
        <<  *2   //左移乘2
        >>  /2   //右移除2

        0000 0000       0
        0000 0001       1
        0000 0010       2
        0000 0011       3
        0000 0100       4
        0000 1000       8
        0001 0000       16
        */

    }
}
